backend/app/controllers/application_controller.rb

    def authenticate_user!
        header = request.headers["Authorization"]   # ヘッダーを取得
        token = header&.split(" ")&.last            # "Bearer xxx" → "xxx"
        decoded = JsonWebToken.decode(token)        # トークンを解読

        @current_user = User.find_by(id: decoded[:user_id]) if decoded
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]