backend/app/controllers/api/v1/auth_controller.rb

            def signup
                user = User.new(user_params)
                if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["created_at", "2026-04-27 13:35:40.567897"], ["updated_at", "2026-04-27 13:35:40.567897"]]