backend/app/controllers/api/v1/vocabularies_controller.rb

        def create
        vocabulary = current_user.vocabularies.build(vocabulary_params)
            if vocabulary.save
---
INSERT INTO "vocabularies" ("user_id", "korean_word", "japanese_meaning", "image_url", "difficulty", "proficiency", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

        def show(vocabulary = current_user.vocabularies.find(params[:id]))
---
SELECT "vocabularies".* FROM "vocabularies" WHERE "vocabularies"."user_id" = $1  [["user_id", 3]]

        def update
          vocabulary = current_user.vocabularies.find(params[:id])
          update_attrs = vocabulary_params.except(:proficiency)

          if params.dig(:vocabulary, :correct) != nil
            delta = params[:vocabulary][:correct] ? 10 : -10
            update_attrs[:proficiency] = (vocabulary.proficiency + delta).clamp(0, 100)
          end

          if vocabulary.update(update_attrs)
---
SELECT "vocabularies".* FROM "vocabularies" WHERE "vocabularies"."user_id" = $1 AND "vocabularies"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
UPDATE "vocabularies" SET "proficiency" = $1, "updated_at" = $2 WHERE "vocabularies"."id" = $3  [["proficiency", 10], ["updated_at", "2026-04-27 21:51:09.081968"], ["id", 1]]